<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>

<!-- フォーム(id検索) -->
<!-- テキストボックス -->
<!-- ボタン(承認画面に移動) -->
<!-- フォーム終わり -->

<!-- リスト(申請一覧) -->
<!-- テキスト(相手の名前) -->
<!-- ボタン(詳細画面に移動) -->
<!-- リスト終わり-->

<p>フレンド一覧</p>
<!-- 可変長のテーブル(フレンドを一覧表示) -->
<!-- フォーム(フレンド1理を対象に詳細ページへ移動するため) -->

<!-- テキスト(相手の名前) -->
<!-- ボタン(詳細画面に移動) -->
<!-- フォーム終わり -->
<!-- 可変長のテーブル終わり -->

</body>
</html>